# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

ghtost_width: 1
backbone:
  # MobileNetV3-small
  # [from, number, module, args]
  # c, exp_size,  k, se_ratio, s ,layer_id
  -  [-1, 1, ConvBNReLU, [ 16, 3, 2 ]] #0-p1/2
  -  [-1, 1, GhostBottleneckV2, [ 16,  16,  3,  0,   1 , 0]]  #1-p1/2  320
  -  [-1, 1, GhostBottleneckV2, [ 24,  48,  3,  0,   2 , 1]]  #2-p2/4
  -  [-1, 1, GhostBottleneckV2, [ 24,  72,  3,  0,   1 , 2]]  #3-p2/4  160
  -  [-1, 1, GhostBottleneckV2, [ 40,  72,  5,  0.25,2 , 3]]  #4-p3/8
  -  [-1, 1, GhostBottleneckV2, [ 40,  120,  5, 0.25,1 , 4]]  #5-p3/8  80
  -  [-1, 1, GhostBottleneckV2, [ 80,  240, 3,  0,   2 , 5]]  #6-p4/16
  -  [-1, 1, GhostBottleneckV2, [ 80,  200, 3,  0,   1 , 6]]  #7-p4/16
  -  [-1, 1, GhostBottleneckV2, [ 80,  184, 3,  0,   1 , 7]]  #8-p4/16
  -  [-1, 1, GhostBottleneckV2, [ 80,  184, 3,  0,   1 , 8]]  #9-p4/16
  -  [-1, 1, GhostBottleneckV2, [ 112, 480, 3,  0.25,1 , 9]]  #10-p4/16
  -  [-1, 1, GhostBottleneckV2, [ 112, 672, 3,  0.25,1 , 10]]  #11-p4/16 40
  -  [-1, 1, GhostBottleneckV2, [ 160, 672, 5,  0.25,2 , 11]]  #12-p5/32
  -  [-1, 1, GhostBottleneckV2, [ 160, 960, 5,  0,   1 , 12]]  #13-p5/32
  -  [-1, 1, GhostBottleneckV2, [ 160, 960, 5,  0.25,1 , 13]]  #14-p5/32
  -  [-1, 1, GhostBottleneckV2, [ 160, 960, 5,  0,   1 , 14]]  #15-p5/32
  -  [-1, 1, GhostBottleneckV2, [ 160, 960, 5,  0.25,1 , 15]]  #16-p5/32
  -  [-1, 1, ConvBNReLU, [960, 1]] #17-p5/32 20


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 11], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 20

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 23 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 26 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 29 (P5/32-large)

  - [[23, 26, 29], 1, Detect, [nc]]  # Detect(P3, P4, P5)