# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs


backbone:
  # MobileNetV3-small
  # [from, number, module, args]
  - [-1, 1, ConvBNReLU, [24, 3, 2]]                        # 0-p1/2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]# 1-p2/4
  - [-1, 1, ShuffleV2Block, [116,  58, 3, 2]] # 2-p3/8
  - [-1, 3, ShuffleV2Block, [116,  58, 3, 1]]  # 3-p3/8
  - [-1, 1, ShuffleV2Block, [232,  116, 3, 2]]  # 4-p3/16
  - [-1, 7, ShuffleV2Block, [232,  116, 3, 1]]  # 5-p4/16
  - [-1, 1, ShuffleV2Block, [464,  232, 3, 2]]  # 6-p5/32
  - [-1, 3, ShuffleV2Block, [464,  232, 3, 1]]  # 7-p5/32
  - [-1, 1, ConvBNReLU, [1024, 1]]  # 8-p5/32

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)